index.org
#+TITLE: Unit Test Talk
#+AUTHOR: Peter Moresi
#+OPTIONS: ^:nil num:nil

#+INFOJS_OPT: path:org-info.js
#+INFOJS_OPT: toc:nil ltoc:t view:info mouse:underline buttons:nil
#+INFOJS_OPT: up:

#+BEGIN_HTML
  <style>
  body {
      font-family: sans-serif;
  }
  h1 {
      font-size: 48px;
  }
  h2 {
      font-size: 45px;
  }
  h3 {
      font-size: 40px;
  }
  h4 {
        font-size: 36px;
  }
  li {
      font-size: 25px;
      padding-bottom: 10px;
  }

  li div {
      font-size: 16px;
      padding-bottom: 0px;
  }
  </style>
#+END_HTML

* Benefits of Unit Testing

  1. *Consistent high quality* software releases

  2. More *predictable outcomes* refactoring

  3. Demonstrate *developer productivity*

  4. Enhanced *customer confidence* in product or service

* Developers role in testing

  1) Developers _should_ know how to write tests.

  2) Developers that write tests are more valuable to the company.
     
  3) Developers should not write tests first or practice TDD.

  4) Writing tests is *_always beneficial_* to the project.

  5) Write new tests for *every iteration*; except refactoring.

     1) Refactoring should not change behavior; only improve organization, performance, ect..

	1) If you break tests refactoring then fix them before you merge.

* How to test like a Developer

  1. Axiom: Ever action performed by a computer can be tested.

     1. *Not* every action performed by a computer *should* be tested.

     2. Testing in isolation is useful. Testing end-to-end is useful too.

     3. _100% test automatation_ is impractical and 100% code coverage is not the same thing.

  2. Write tests until _you and your stakeholders feel confident shipping_.

  3. Some things are so hard that automating them is less efficient then manual testing.
     
     1. Testing CSS/DOM behavior on multiple browsers and devices.

  4. Automated testing will never completely replace manual testing.

     1. All developer test their own code...some better than others.

     2. Writing unit tests makes the job easier, but not always more fun.

* Why use a Test Framework

  1. *Because they make better test reports.*
  3. They never forget to a run a test.
  4. They are widely available on every major platform.
  5. They guide you into common test patterns (setup, execute, teardown).
  6. They help with advanced cases like testing database changes.
  
* Get started with unit testing
  
  - Testing a *single function* is the first step.
    
  - Today's example will test a guarded "Say Hello" function in Ruby
    
** Ruby
*** Say Hello in Ruby

    #+NAME: say_hello
    #+BEGIN_SRC ruby :tangle say_hello.rb
      def say_hello(name)
        if not name.is_a? String
          raise ArgumentError, "This is not a string. It is a #{name.class}."
        end

        "Hello, #{name}"
      end
    #+END_SRC
*** Simplest possible test case
    
    This test ensures correct syntax and basic behavior.
    
    #+BEGIN_SRC ruby
      require "./say_hello.rb"
      say_hello "World"
    #+END_SRC
    
*** Remember to test exception cases too
    
    #+BEGIN_SRC ruby :results output
      require './say_hello.rb'
      puts say_hello("World")

      begin
        say_hello({ Name: "Peter" })
      rescue Exception => e
        puts "raises exception: #{e}"
      end
    #+END_SRC
    
*** Measure code coverage

    This test covers 100% of the code paths. This means that every line of code
    is executed by running the test code. There are tools to automate the collection
    of this metric.

    #+BEGIN_SRC ruby :results output
      require "coverage.so"

      Coverage.start
      require "./say_hello.rb"

      say_hello("World")

      begin
       	say_hello({ Name: "Peter" })
      rescue Exception => e
       	puts "raises exception: #{e}"
      end

      puts Coverage.result 
     #+END_SRC

     #+RESULTS:
     : raises exception: This is not a string. It is a Hash.
     : {"/Users/jenmoresi/src/how-to-test-like-software-engineer/say_hello.rb"=>[1, 2, 1, nil, nil, 1, nil]}

