index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Unit Test Talk Notes</title>
<!-- 2015-05-07 Thu 11:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Peter Moresi" />


</head>
<body>
<div id="content">
<h1 class="title">Unit Test Talk Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Benefits of Unit Testing</a></li>
<li><a href="#sec-2">Developers role in testing</a></li>
<li><a href="#sec-3">How to test like a Developer</a></li>
<li><a href="#sec-4">Why use a Test Framework</a></li>
<li><a href="#sec-5">Get started with unit testing</a>
<ul>
<li><a href="#sec-5-1">Ruby</a>
<ul>
<li><a href="#sec-5-1-1">Say Hello in Ruby</a></li>
<li><a href="#sec-5-1-2">Simplest possible test case</a></li>
<li><a href="#sec-5-1-3">Remember to test exception cases too</a></li>
<li><a href="#sec-5-1-4">Measure code coverage</a></li>
<li><a href="#sec-5-1-5">Minitest framework</a></li>
<li><a href="#sec-5-1-6">RSpec framework</a></li>
<li><a href="#sec-5-1-7">Cucumber with Ruby</a></li>
</ul>
</li>
<li><a href="#sec-5-2">JavaScript</a>
<ul>
<li><a href="#sec-5-2-1">Say Hello in JavaScript</a></li>
<li><a href="#sec-5-2-2">Simplest possible test case</a></li>
<li><a href="#sec-5-2-3">QUnit framework</a></li>
<li><a href="#sec-5-2-4">Jasmine framework</a></li>
<li><a href="#sec-5-2-5">Cucumber with JavaScript</a></li>
</ul>
</li>
<li><a href="#sec-5-3">Clojure</a>
<ul>
<li><a href="#sec-5-3-1">Say Hello in Clojure</a></li>
<li><a href="#sec-5-3-2">Simplest possible test case</a></li>
<li><a href="#sec-5-3-3">clojure.test framework</a></li>
</ul>
</li>
<li><a href="#sec-5-4">CSharp</a>
<ul>
<li><a href="#sec-5-4-1">Say Hello in CSharp</a></li>
<li><a href="#sec-5-4-2">Simplest possible test</a></li>
<li><a href="#sec-5-4-3">Test with NUnit Framework</a></li>
</ul>
</li>
<li><a href="#sec-5-5">Java</a>
<ul>
<li><a href="#sec-5-5-1">Say Hello in Java</a></li>
<li><a href="#sec-5-5-2">Simplest possible test</a></li>
<li><a href="#sec-5-5-3">Test with JUnit</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<style>
body {
    font-family: sans-serif;
}
h2 {
    font-size: 45px;
}
h3 {
    font-size: 40px;
}
h4 {
      font-size: 36px;
}
li {
    font-size: 25px;
    padding-bottom: 10px;
}

li div {
    font-size: 16px;
    padding-bottom: 0px;
}
</style>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Benefits of Unit Testing</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><b>Consistent high quality</b> software releases
</li>

<li>More <b>predictable outcomes</b> refactoring
</li>

<li>Demonstrate <b>developer productivity</b>
</li>

<li>Enhanced <b>customer confidence</b> in product or service
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Developers role in testing</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Developers <span class="underline">should</span> know how to write tests.
</li>

<li>Developers that write tests are more valuable to the company.
</li>

<li>Developers should not write tests first or practice TDD.
</li>

<li>Writing tests is <b><span class="underline">always beneficial</span></b> to the project.
</li>

<li>Write new tests for <b>every iteration</b>; except refactoring.

<ol class="org-ol">
<li>Refactoring should not change behavior; only improve organization, performance, ect..

<ol class="org-ol">
<li>If you break tests refactoring then fix them before you merge.
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">How to test like a Developer</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Axiom: Ever action performed by a computer can be tested.

<ol class="org-ol">
<li><b>Not</b> every action performed by a computer <b>should</b> be tested.
</li>

<li>Testing in isolation is useful. Testing end-to-end is useful too.
</li>

<li><span class="underline">100% test automatation</span> is impractical and 100% code coverage is not the same thing.
</li>
</ol>
</li>

<li>Write tests until <span class="underline">you and your stakeholders feel confident shipping</span>.
</li>

<li>Some things are so hard that automating them is less efficient then manual testing.

<ol class="org-ol">
<li>Testing CSS/DOM behavior on multiple browsers and devices.
</li>
</ol>
</li>

<li>Automated testing will never completely replace manual testing.

<ol class="org-ol">
<li>All developer test their own code&#x2026;some better than others.
</li>

<li>Writing unit tests makes the job easier, but not always more fun.
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Why use a Test Framework</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><b>Because they make better test reports.</b>
</li>
<li>They never forget to a run a test.
</li>
<li>They are widely available on every major platform.
</li>
<li>They guide you into common test patterns (setup, execute, teardown).
</li>
<li>They help with advanced cases like testing database changes.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Get started with unit testing</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Testing a <b>single function</b> is the first step.
</li>

<li>Today's example will test a guarded "Say Hello" function in Ruby
</li>
</ul>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Ruby</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">Say Hello in Ruby</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">

<pre class="src src-ruby" id="say_hello"><span style="color: #0000FF;">def</span> <span style="color: #006699;">say_hello</span>(name)
  <span style="color: #0000FF;">if</span> <span style="color: #0000FF;">not</span> name.is_a? <span style="color: #6434A3;">String</span>
    <span style="color: #006FE0;">raise</span> <span style="color: #6434A3;">ArgumentError</span>, <span style="color: #008000;">"This is not a string. It is a </span><span style="color: #BA36A5;">#{name.class}</span><span style="color: #008000;">."</span>
  <span style="color: #0000FF;">end</span>

  <span style="color: #008000;">"Hello, </span><span style="color: #BA36A5;">#{name}</span><span style="color: #008000;">"</span>
<span style="color: #0000FF;">end</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">Simplest possible test case</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
This test ensures correct syntax and basic behavior.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #006FE0;">require</span> <span style="color: #008000;">"./say_hello.rb"</span>
say_hello <span style="color: #008000;">"World"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3">Remember to test exception cases too</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #006FE0;">require</span> <span style="color: #008000;">'./say_hello.rb'</span>
<span style="color: #006FE0;">puts</span> say_hello(<span style="color: #008000;">"World"</span>)

<span style="color: #0000FF;">begin</span>
  say_hello({ <span style="color: #6434A3;">Name</span>: <span style="color: #008000;">"Peter"</span> })
<span style="color: #0000FF;">rescue</span> <span style="color: #6434A3;">Exception</span> =&gt; e
  <span style="color: #006FE0;">puts</span> <span style="color: #008000;">"raises exception: </span><span style="color: #BA36A5;">#{e}</span><span style="color: #008000;">"</span>
<span style="color: #0000FF;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4">Measure code coverage</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
This test covers 100% of the code paths. This means that every line of code
is executed by running the test code. There are tools to automate the collection
of this metric.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #006FE0;">require</span> <span style="color: #008000;">"coverage.so"</span>

<span style="color: #6434A3;">Coverage</span>.start
<span style="color: #006FE0;">require</span> <span style="color: #008000;">"./say_hello.rb"</span>

say_hello(<span style="color: #008000;">"World"</span>)

<span style="color: #0000FF;">begin</span>
  say_hello({ <span style="color: #6434A3;">Name</span>: <span style="color: #008000;">"Peter"</span> })
<span style="color: #0000FF;">rescue</span> <span style="color: #6434A3;">Exception</span> =&gt; e
  <span style="color: #006FE0;">puts</span> <span style="color: #008000;">"raises exception: </span><span style="color: #BA36A5;">#{e}</span><span style="color: #008000;">"</span>
<span style="color: #0000FF;">end</span>

<span style="color: #006FE0;">puts</span> <span style="color: #6434A3;">Coverage</span>.result
</pre>
</div>
</div>
</div>
