index.org
*** Minitest framework
    
    Author test for the  minitest framework.
    
    #+BEGIN_SRC ruby :tangle say_hello_unit_test.rb 
       # Run with command: ruby -Ilib:test say_hello_unit_test.rb
       require 'minitest/autorun'
       require './say_hello.rb'

       class TestSayHello < MiniTest::Unit::TestCase

         def test_hello_peter
           assert_equal say_hello("World"), "Hello, World"
         end

         def test_that_hash_is_guarded
           assert_raises ArgumentError do
             say_hello({ Name: "Peter" })
           end
         end

         def test_that_number_is_guarded
           assert_raises ArgumentError do
             say_hello(3)
           end
         end

         def test_that_date_is_guarded
           assert_raises ArgumentError do
             say_hello(Time.now)
           end
         end
       end
    #+END_SRC
    
*** RSpec framework
    
    Author tests uses a BDD style with the RSpec framework.

       #+BEGIN_SRC ruby :tangle say_hello_rspec_test.rb
         # Run with command:  rspec say_hello_rspec_test.rb -c
         require './say_hello.rb'

         describe "say_hello" do

           it "should accept a String" do
            expect(say_hello("World")).to eq("Hello, World")
           end

           it "should raise ArgumentError on Hash" do
             expect { say_hello({ Name: "Peter" }) }.to raise_error(ArgumentError)
           end

           it "should raise ArgumentError on int" do
             expect { say_hello(3) }.to raise_error(ArgumentError)
           end

           it "should raise ArgumentError on Time" do
             expect { say_hello(Time.now) }.to raise_error(ArgumentError)
           end

         end
     #+END_SRC

*** Cucumber with Ruby
    
    Purpose is to describe software behavior with a programming language neutral DSL.
    
**** Install
     #+BEGIN_SRC sh
       gem install cucumber
     #+END_SRC
**** Feature Definition
     
     #+BEGIN_SRC feature :tangle features/say_hello.feature
       Feature: Say Hello
         As a programmer
         I want a function that takes a name and concatenates with "Hello, ".
         So that I can demonstrate test techniques during the talk.

         Scenario: Pass string as name
           Given your name is "World"
           When I say hello
           Then the result is "Hello, World"

         Scenario: Evil programmer passes number
           Given your name is 2
           When I say hello
           Then the result is ArgumentException

         Scenario: Evil programmer passes object
           Given your name is User Hash
           When I say hello
           Then the result is ArgumentException
     #+END_SRC
     
**** Step Definitions

       	Purpose is to make sentences to code operations.

       	#+BEGIN_SRC ruby :tangle features/step_definitions/say_hello_steps.rb
          require './say_hello.rb'

          Given(/^your name is "([^"]*)"$/) do |name|
            @name = name
          end

          Given(/^your name is (\d+)$/) do |name|
            @name = name.to_i
          end


          Given(/^your name is User Hash/) do
            @name = { name: "MyNameHere" }
          end

          When "I say hello" do
            begin
              @result = say_hello @name
            rescue Exception => e
              @result = e
            end
          end

          Then /the result is "([^"]*)"$/ do |result|
            expect(result).to eq(@result)
          end

          Then(/^the result is ArgumentException$/) do
            expect(@result.is_a? ArgumentError).to eq(true)
          end

       	#+END_SRC

**** Run tests on terminal

       	#+BEGIN_SRC sh
          cucumber -f pretty
       	#+END_SRC

** JavaScript
*** Say Hello in JavaScript

    #+NAME: say_hello_js
    #+BEGIN_SRC js :tangle say_hello.js
      function say_hello(name) {
          if (typeof name !== "string") {
              throw "This is not a string. It is a " + name.constructor.name + ".";
          }

          return "Hello, " + name;
      };

      if (module) { module.exports = say_hello; }
    #+END_SRC

*** Simplest possible test case
  #+BEGIN_SRC js :noweb yes :results output
    <<say_hello_js>>
    console.log( say_hello("World") );   
  #+END_SRC
*** QUnit framework
    [[./qunit-test-page.html][Open Test]]
