index.html

<div id="outline-container-sec-5-1-5" class="outline-4">
<h4 id="sec-5-1-5">Minitest framework</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
Author test for the  minitest framework.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Run with command: ruby -Ilib:test say_hello_unit_test.rb</span>
<span style="color: #006FE0;">require</span> <span style="color: #008000;">'minitest/autorun'</span>
<span style="color: #006FE0;">require</span> <span style="color: #008000;">'./say_hello.rb'</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">TestSayHello</span> &lt; <span style="color: #6434A3;">MiniTest</span>::<span style="color: #6434A3;">Unit</span>::<span style="color: #6434A3;">TestCase</span>

  <span style="color: #0000FF;">def</span> <span style="color: #006699;">test_hello_peter</span>
    assert_equal say_hello(<span style="color: #008000;">"World"</span>), <span style="color: #008000;">"Hello, World"</span>
  <span style="color: #0000FF;">end</span>

  <span style="color: #0000FF;">def</span> <span style="color: #006699;">test_that_hash_is_guarded</span>
    assert_raises <span style="color: #6434A3;">ArgumentError</span> <span style="color: #0000FF;">do</span>
      say_hello({ <span style="color: #6434A3;">Name</span>: <span style="color: #008000;">"Peter"</span> })
    <span style="color: #0000FF;">end</span>
  <span style="color: #0000FF;">end</span>

  <span style="color: #0000FF;">def</span> <span style="color: #006699;">test_that_number_is_guarded</span>
    assert_raises <span style="color: #6434A3;">ArgumentError</span> <span style="color: #0000FF;">do</span>
      say_hello(3)
    <span style="color: #0000FF;">end</span>
  <span style="color: #0000FF;">end</span>

  <span style="color: #0000FF;">def</span> <span style="color: #006699;">test_that_date_is_guarded</span>
    assert_raises <span style="color: #6434A3;">ArgumentError</span> <span style="color: #0000FF;">do</span>
      say_hello(<span style="color: #6434A3;">Time</span>.now)
    <span style="color: #0000FF;">end</span>
  <span style="color: #0000FF;">end</span>
<span style="color: #0000FF;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-1-6" class="outline-4">
<h4 id="sec-5-1-6">RSpec framework</h4>
<div class="outline-text-4" id="text-5-1-6">
<p>
Author tests uses a BDD style with the RSpec framework.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Run with command:  rspec say_hello_rspec_test.rb -c</span>
<span style="color: #006FE0;">require</span> <span style="color: #008000;">'./say_hello.rb'</span>

describe <span style="color: #008000;">"say_hello"</span> <span style="color: #0000FF;">do</span>

  it <span style="color: #008000;">"should accept a String"</span> <span style="color: #0000FF;">do</span>
   expect(say_hello(<span style="color: #008000;">"World"</span>)).to eq(<span style="color: #008000;">"Hello, World"</span>)
  <span style="color: #0000FF;">end</span>

  it <span style="color: #008000;">"should raise ArgumentError on Hash"</span> <span style="color: #0000FF;">do</span>
    expect { say_hello({ <span style="color: #6434A3;">Name</span>: <span style="color: #008000;">"Peter"</span> }) }.to raise_error(<span style="color: #6434A3;">ArgumentError</span>)
  <span style="color: #0000FF;">end</span>

  it <span style="color: #008000;">"should raise ArgumentError on int"</span> <span style="color: #0000FF;">do</span>
    expect { say_hello(3) }.to raise_error(<span style="color: #6434A3;">ArgumentError</span>)
  <span style="color: #0000FF;">end</span>

  it <span style="color: #008000;">"should raise ArgumentError on Time"</span> <span style="color: #0000FF;">do</span>
    expect { say_hello(<span style="color: #6434A3;">Time</span>.now) }.to raise_error(<span style="color: #6434A3;">ArgumentError</span>)
  <span style="color: #0000FF;">end</span>

<span style="color: #0000FF;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-1-7" class="outline-4">
<h4 id="sec-5-1-7">Cucumber with Ruby</h4>
<div class="outline-text-4" id="text-5-1-7">
<p>
Purpose is to describe software behavior with a programming language neutral DSL.
</p>
</div>

<ul class="org-ul"><li><a id="sec-5-1-7-1" name="sec-5-1-7-1"></a>Install<br  /><div class="outline-text-5" id="text-5-1-7-1">
<div class="org-src-container">

<pre class="src src-sh">gem install cucumber
</pre>
</div>
</div>
</li>
<li><a id="sec-5-1-7-2" name="sec-5-1-7-2"></a>Feature Definition<br  /><div class="outline-text-5" id="text-5-1-7-2">
<div class="org-src-container">

<pre class="src src-feature"><span style="color: #0000FF;">Feature:</span><span style="color: #6434A3;"> Say Hello</span>
  As a programmer
  I want a function that takes a name and concatenates with <span style="color: #008000;">"Hello, "</span>.
  So that I can demonstrate test techniques during the talk.

<span style="color: #0000FF;">  Scenario:</span><span style="color: #006699;"> Pass string as name</span>
<span style="color: #0000FF;">    Given</span> your name is <span style="color: #008000;">"World"</span>
<span style="color: #0000FF;">    When</span> I say hello
<span style="color: #0000FF;">    Then</span> the result is <span style="color: #008000;">"Hello, World"</span>

<span style="color: #0000FF;">  Scenario:</span><span style="color: #006699;"> Evil programmer passes number</span>
<span style="color: #0000FF;">    Given</span> your name is 2
<span style="color: #0000FF;">    When</span> I say hello
<span style="color: #0000FF;">    Then</span> the result is ArgumentException

<span style="color: #0000FF;">  Scenario:</span><span style="color: #006699;"> Evil programmer passes object</span>
<span style="color: #0000FF;">    Given</span> your name is User Hash
<span style="color: #0000FF;">    When</span> I say hello
<span style="color: #0000FF;">    Then</span> the result is ArgumentException
</pre>
</div>
</div>
</li>

<li><a id="sec-5-1-7-3" name="sec-5-1-7-3"></a>Step Definitions<br  /><div class="outline-text-5" id="text-5-1-7-3">
<p>
Purpose is to make sentences to code operations.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #006FE0;">require</span> <span style="color: #008000;">'./say_hello.rb'</span>

Given(<span style="color: #008000;">/^your name is "([^"]*)"$/</span>) <span style="color: #0000FF;">do</span> |name|
  <span style="color: #BA36A5;">@name</span> = name
<span style="color: #0000FF;">end</span>

Given(<span style="color: #008000;">/^your name is (\d+)$/</span>) <span style="color: #0000FF;">do</span> |name|
  <span style="color: #BA36A5;">@name</span> = name.to_i
<span style="color: #0000FF;">end</span>


Given(<span style="color: #008000;">/^your name is User Hash/</span>) <span style="color: #0000FF;">do</span>
  <span style="color: #BA36A5;">@name</span> = { <span style="color: #D0372D;">name</span>: <span style="color: #008000;">"MyNameHere"</span> }
<span style="color: #0000FF;">end</span>

<span style="color: #6434A3;">When</span> <span style="color: #008000;">"I say hello"</span> <span style="color: #0000FF;">do</span>
  <span style="color: #0000FF;">begin</span>
    <span style="color: #BA36A5;">@result</span> = say_hello <span style="color: #BA36A5;">@name</span>
  <span style="color: #0000FF;">rescue</span> <span style="color: #6434A3;">Exception</span> =&gt; e
    <span style="color: #BA36A5;">@result</span> = e
  <span style="color: #0000FF;">end</span>
<span style="color: #0000FF;">end</span>

<span style="color: #6434A3;">Then</span> <span style="color: #008000;">/the result is "([^"]*)"$/</span> <span style="color: #0000FF;">do</span> |result|
  expect(result).to eq(<span style="color: #BA36A5;">@result</span>)
<span style="color: #0000FF;">end</span>

Then(<span style="color: #008000;">/^the result is ArgumentException$/</span>) <span style="color: #0000FF;">do</span>
  expect(<span style="color: #BA36A5;">@result</span>.is_a? <span style="color: #6434A3;">ArgumentError</span>).to eq(<span style="color: #BA36A5;">true</span>)
<span style="color: #0000FF;">end</span>
</pre>
</div>
</div>
</li>

<li><a id="sec-5-1-7-4" name="sec-5-1-7-4"></a>Run tests on terminal<br  /><div class="outline-text-5" id="text-5-1-7-4">
<div class="org-src-container">

<pre class="src src-sh">cucumber -f pretty
</pre>
</div>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">JavaScript</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1">Say Hello in JavaScript</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">

<pre class="src src-js" id="say_hello_js"><span style="color: #0000FF;">function</span> <span style="color: #006699;">say_hello</span>(<span style="color: #BA36A5;">name</span>) {
    <span style="color: #0000FF;">if</span> (<span style="color: #0000FF;">typeof</span> name !== <span style="color: #008000;">"string"</span>) {
        <span style="color: #0000FF;">throw</span> <span style="color: #008000;">"This is not a string. It is a "</span> + name.constructor.name + <span style="color: #008000;">"."</span>;
    }

    <span style="color: #0000FF;">return</span> <span style="color: #008000;">"Hello, "</span> + name;
};

<span style="color: #0000FF;">if</span> (module) { module.exports = say_hello; }
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2">Simplest possible test case</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">function</span> <span style="color: #006699;">say_hello</span>(<span style="color: #BA36A5;">name</span>) {
    <span style="color: #0000FF;">if</span> (<span style="color: #0000FF;">typeof</span> name !== <span style="color: #008000;">"string"</span>) {
        <span style="color: #0000FF;">throw</span> <span style="color: #008000;">"This is not a string. It is a "</span> + name.constructor.name + <span style="color: #008000;">"."</span>;
    }

    <span style="color: #0000FF;">return</span> <span style="color: #008000;">"Hello, "</span> + name;
};

<span style="color: #0000FF;">if</span> (module) { module.exports = say_hello; }
console.log( say_hello(<span style="color: #008000;">"World"</span>) );
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3">QUnit framework</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
<a href="./qunit-test-page.html">Open Test</a>
</p>
</div>
<ul class="org-ul"><li><a id="sec-5-2-3-1" name="sec-5-2-3-1"></a>Test Page<br  /><div class="outline-text-5" id="text-5-2-3-1">
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000FF;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #006699;">html</span>&gt;
  &lt;<span style="color: #006699;">head</span>&gt;
    &lt;<span style="color: #006699;">meta</span> <span style="color: #BA36A5;">charset</span>=<span style="color: #008000;">"utf-8"</span>&gt;
