index.org
**** Test Page

     #+BEGIN_SRC html :tangle qunit-test-page.html
       <!DOCTYPE html>
       <html>
         <head>
           <meta charset="utf-8">
           <title>QUnit Example</title>
           <link rel="stylesheet" href="http://code.jquery.com/qunit/qunit-1.18.0.css">
         </head>
         <body>
           <div id="qunit"></div>
           <div id="qunit-fixture"></div>
           <script src="http://code.jquery.com/qunit/qunit-1.18.0.js"></script>
           <script src="say_hello.js"></script>
           <script src="say_hello_qunit_tests.js"></script>
         </body>
       </html>
    #+END_SRC
**** Test Script
     #+BEGIN_SRC js :tangle say_hello_qunit_tests.js
       QUnit.test( "hello world", function( assert ) {
           assert.ok( say_hello("World") == "Hello, World", "Passed!", "Epic Failure!" );
       });

       QUnit.test( "number is guarded", function( assert ) {
           assert.throws(
               function() {
                   say_hello(3)
               },
               "This is not a string. It is a Number"
         );
       });

       QUnit.test( "object is guarded", function( assert ) {
           assert.throws(
               function() {
                   say_hello({ name: "World" })
               },
               "This is not a string. It is a Object"
         );
       });

       QUnit.test( "date is guarded", function( assert ) {
           assert.throws(
               function() {
                   say_hello(new Date())
               },
               "This is not a string. It is a Date"
         );
       });
     #+END_SRC
*** Jasmine framework

     [[./jasmine-test-page.html][Open Test]]

**** Test Page

     #+BEGIN_SRC html :tangle jasmine-test-page.html
       <!DOCTYPE html>
       <html>
         <head>
           <meta charset="utf-8">
           <title>Jasmine Example</title>
           <link rel="stylesheet" href="http://code.jquery.com/qunit/qunit-1.18.0.css">
         </head>
         <body>
           <div id="qunit"></div>
           <div id="qunit-fixture"></div>
           <link rel="shortcut icon" type="image/png" href="jasmine/images/jasmine_favicon.png">
           <link rel="stylesheet" type="text/css" href="jasmine/lib/jasmine-core/jasmine.css">

           <script type="text/javascript" src="jasmine/lib/jasmine-core/jasmine.js"></script>
           <script type="text/javascript" src="jasmine/lib/jasmine-core/jasmine-html.js"></script>
           <script type="text/javascript" src="jasmine/lib/jasmine-core/boot.js"></script>
           <script src="say_hello.js"></script>
           <script src="say_hello_jasmine_tests.js"></script>
         </body>
       </html>
     #+END_SRC

**** Test Script
     #+BEGIN_SRC js :tangle say_hello_jasmine_tests.js
       describe("say_hello", function() {
           it( "should return 'Hello, World'", function() {
               expect( say_hello("World") ).toBe("Hello, World");
           });

           it( "should raise error on number", function() {
               expect( function() { say_hello(2) } ).toThrow("This is not a string. It is a Number.");
           });

           it( "should raise error on hash", function() {
               expect( function() { say_hello({ name: "World" }) } ).toThrow("This is not a string. It is a Object.");
           });

           it( "should raise error on date", function() {
               expect( function() { say_hello(new Date()) } ).toThrow("This is not a string. It is a Date.");
           });

       });
     #+END_SRC
*** Cucumber with JavaScript
**** Install
     #+BEGIN_SRC sh
       npm install -g cucumber
     #+END_SRC
**** Feature Definition 

     See Ruby Example

