index.html
    &lt;<span style="color: #006699;">title</span>&gt;<span style="color: #000000; font-weight: bold; text-decoration: underline;">QUnit Example</span>&lt;/<span style="color: #006699;">title</span>&gt;
    &lt;<span style="color: #006699;">link</span> <span style="color: #BA36A5;">rel</span>=<span style="color: #008000;">"stylesheet"</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"http://code.jquery.com/qunit/qunit-1.18.0.css"</span>&gt;
  &lt;/<span style="color: #006699;">head</span>&gt;
  &lt;<span style="color: #006699;">body</span>&gt;
    &lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"qunit"</span>&gt;&lt;/<span style="color: #006699;">div</span>&gt;
    &lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"qunit-fixture"</span>&gt;&lt;/<span style="color: #006699;">div</span>&gt;
    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"http://code.jquery.com/qunit/qunit-1.18.0.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"say_hello.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"say_hello_qunit_tests.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
  &lt;/<span style="color: #006699;">body</span>&gt;
&lt;/<span style="color: #006699;">html</span>&gt;
</pre>
</div>
</div>
</li>
<li><a id="sec-5-2-3-2" name="sec-5-2-3-2"></a>Test Script<br  /><div class="outline-text-5" id="text-5-2-3-2">
<div class="org-src-container">

<pre class="src src-js">QUnit.test( <span style="color: #008000;">"hello world"</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">assert</span> ) {
    assert.ok( say_hello(<span style="color: #008000;">"World"</span>) == <span style="color: #008000;">"Hello, World"</span>, <span style="color: #008000;">"Passed!"</span>, <span style="color: #008000;">"Epic Failure!"</span> );
});

QUnit.test( <span style="color: #008000;">"number is guarded"</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">assert</span> ) {
    assert.<span style="color: #0000FF;">throws</span>(
        <span style="color: #0000FF;">function</span>() {
            say_hello(3)
        },
        <span style="color: #008000;">"This is not a string. It is a Number"</span>
  );
});

QUnit.test( <span style="color: #008000;">"object is guarded"</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">assert</span> ) {
    assert.<span style="color: #0000FF;">throws</span>(
        <span style="color: #0000FF;">function</span>() {
            say_hello({ name: <span style="color: #008000;">"World"</span> })
        },
        <span style="color: #008000;">"This is not a string. It is a Object"</span>
  );
});

QUnit.test( <span style="color: #008000;">"date is guarded"</span>, <span style="color: #0000FF;">function</span>( <span style="color: #BA36A5;">assert</span> ) {
    assert.<span style="color: #0000FF;">throws</span>(
        <span style="color: #0000FF;">function</span>() {
            say_hello(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span>())
        },
        <span style="color: #008000;">"This is not a string. It is a Date"</span>
  );
});
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4">Jasmine framework</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
<a href="./jasmine-test-page.html">Open Test</a>
</p>
</div>

<ul class="org-ul"><li><a id="sec-5-2-4-1" name="sec-5-2-4-1"></a>Test Page<br  /><div class="outline-text-5" id="text-5-2-4-1">
<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #0000FF;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #006699;">html</span>&gt;
  &lt;<span style="color: #006699;">head</span>&gt;
    &lt;<span style="color: #006699;">meta</span> <span style="color: #BA36A5;">charset</span>=<span style="color: #008000;">"utf-8"</span>&gt;
    &lt;<span style="color: #006699;">title</span>&gt;<span style="color: #000000; font-weight: bold; text-decoration: underline;">Jasmine Example</span>&lt;/<span style="color: #006699;">title</span>&gt;
    &lt;<span style="color: #006699;">link</span> <span style="color: #BA36A5;">rel</span>=<span style="color: #008000;">"stylesheet"</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"http://code.jquery.com/qunit/qunit-1.18.0.css"</span>&gt;
  &lt;/<span style="color: #006699;">head</span>&gt;
  &lt;<span style="color: #006699;">body</span>&gt;
    &lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"qunit"</span>&gt;&lt;/<span style="color: #006699;">div</span>&gt;
    &lt;<span style="color: #006699;">div</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"qunit-fixture"</span>&gt;&lt;/<span style="color: #006699;">div</span>&gt;
    &lt;<span style="color: #006699;">link</span> <span style="color: #BA36A5;">rel</span>=<span style="color: #008000;">"shortcut icon"</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"image/png"</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"jasmine/images/jasmine_favicon.png"</span>&gt;
    &lt;<span style="color: #006699;">link</span> <span style="color: #BA36A5;">rel</span>=<span style="color: #008000;">"stylesheet"</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span> <span style="color: #BA36A5;">href</span>=<span style="color: #008000;">"jasmine/lib/jasmine-core/jasmine.css"</span>&gt;

    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/javascript"</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"jasmine/lib/jasmine-core/jasmine.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/javascript"</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"jasmine/lib/jasmine-core/jasmine-html.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/javascript"</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"jasmine/lib/jasmine-core/boot.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"say_hello.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
    &lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"say_hello_jasmine_tests.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
  &lt;/<span style="color: #006699;">body</span>&gt;
&lt;/<span style="color: #006699;">html</span>&gt;
</pre>
</div>
</div>
</li>

<li><a id="sec-5-2-4-2" name="sec-5-2-4-2"></a>Test Script<br  /><div class="outline-text-5" id="text-5-2-4-2">
<div class="org-src-container">

<pre class="src src-js">describe(<span style="color: #008000;">"say_hello"</span>, <span style="color: #0000FF;">function</span>() {
    it( <span style="color: #008000;">"should return 'Hello, World'"</span>, <span style="color: #0000FF;">function</span>() {
        expect( say_hello(<span style="color: #008000;">"World"</span>) ).toBe(<span style="color: #008000;">"Hello, World"</span>);
    });

    it( <span style="color: #008000;">"should raise error on number"</span>, <span style="color: #0000FF;">function</span>() {
        expect( <span style="color: #0000FF;">function</span>() { say_hello(2) } ).toThrow(<span style="color: #008000;">"This is not a string. It is a Number."</span>);
    });

    it( <span style="color: #008000;">"should raise error on hash"</span>, <span style="color: #0000FF;">function</span>() {
        expect( <span style="color: #0000FF;">function</span>() { say_hello({ name: <span style="color: #008000;">"World"</span> }) } ).toThrow(<span style="color: #008000;">"This is not a string. It is a Object."</span>);
    });

    it( <span style="color: #008000;">"should raise error on date"</span>, <span style="color: #0000FF;">function</span>() {
        expect( <span style="color: #0000FF;">function</span>() { say_hello(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Date</span>()) } ).toThrow(<span style="color: #008000;">"This is not a string. It is a Date."</span>);
    });

});
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-5-2-5" class="outline-4">
<h4 id="sec-5-2-5">Cucumber with JavaScript</h4>
<div class="outline-text-4" id="text-5-2-5">
</div><ul class="org-ul"><li><a id="sec-5-2-5-1" name="sec-5-2-5-1"></a>Install<br  /><div class="outline-text-5" id="text-5-2-5-1">
<div class="org-src-container">

<pre class="src src-sh">npm install -g cucumber
</pre>
</div>
</div>
</li>
<li><a id="sec-5-2-5-2" name="sec-5-2-5-2"></a>Feature Definition<br  /><div class="outline-text-5" id="text-5-2-5-2">
<p>
See Ruby Example
</p>
</div>
</li>
