index.org
**** Step Definitions

    #+BEGIN_SRC js :tangle features/step_definitions/say_hello_steps.js
      say_hello = require('../../say_hello.js');

      var myStepDefinitionsWrapper = function () {
          var name, result, error = false;

          this.Given(/^your name is (\d+)$/, function (arg1, callback) {
              name = +arg1;
              callback();
          });

          this.Given(/^your name is "([^"]*)"$/, function (arg1, callback) {
              name = arg1;
              callback();
          });

          this.Given(/^your name is User Hash$/, function (callback) {
              name = { name: "MyNameHere" };
              callback();
          });


          this.When(/^I say ([^"]*)/, function (arg1, callback) {
              try {
                  result = say_hello(name);
                  callback();
              } catch(e) {
                  error = true;
                  result = e;
                  callback()
              }
          });

          this.Then(/^the result is "([^"]*)"$/, function (arg1, callback) {
              if (arg1 !== result) {
                  callback.fail("Expected: " + arg1 + ". Actual: " + result);
              } else {
                  callback();
              }
          });

          this.Then(/^the result is ArgumentException$/, function (callback) {
              // Write code here that turns the phrase above into concrete actions
              if (error) {
                  callback();
              } else {
                  callback.fail("Expected error");
              }
          });


      }

      module.exports = myStepDefinitionsWrapper;

    #+END_SRC
**** Run on command line

     #+BEGIN_SRC sh
       cucumber-js -f pretty
     #+END_SRC

** Clojure
*** Say Hello in Clojure
   #+NAME: say_hello_clj
   #+BEGIN_SRC clojure :tangle say_hello.clj
     (defn say_hello [name] 
      (if (string? name) 
        (apply str (concat "Hello, " name)) 
        (throw (Exception. 
                (apply str (concat "This is not a string. It is a " (type name)))))))
   #+END_SRC
*** Simplest possible test case
   #+BEGIN_SRC clojure
     (load-file "say_hello.clj")
     (say_hello "World")
   #+END_SRC
*** clojure.test framework

   #+BEGIN_SRC clojure
     (use 'clojure.test)

     (load-file "say_hello.clj")

     (deftest hello-world-test
       (testing "returns Hello, World"
         (is (= "Hello, World" (say_hello "World"))))))

     (run-tests)
   #+END_SRC

*** WAIT Cucumber with Clojure					   :noexport:
**** Step Definitions
     #+BEGIN_SRC clojure
       (use 'clojure-cukes.core)
       (use 'clojure.test)

       (Given #"^I have (\d+) big \"([^\"]*)\" in my belly$" [n, thing]
              (reset! belly (repeat (read-string n) thing)))

       (When #"I eat (\d+) \"([^\"]*)\"" [n, thing]
             (eat (repeat (read-string n) thing)))

       (Then #"^I am \"([^\"]*)\"$" [mood-name]
             (assert (= (name (mood)) mood-name)))     
     #+END_SRC
** CSharp
*** Say Hello in CSharp
    #+NAME: say_hello_csharp
    #+BEGIN_SRC csharp
      using System;

      namespace HelloCSharp
      {
          class Friendly {
              // EXAMPLE ONLY: DON'T DO THIS
          // Real C# programs should not use "object" as argument type!
              public static string say_hello( object name ){ 
                  if (name is String) {
                      return "Hello, " + name;
                  }

                  throw new ArgumentError("This is not a string. It is a " + typeof(name));
              }
          }
      }

    #+END_SRC
*** Simplest possible test
    #+BEGIN_SRC csharp
      using System;
      using System.Diagnostics;

      namespace HelloCSharp
      {
              class MainClass
              {
                      public static void Main (string[] args)
                      {
                              Debug.Assert("Hello, World" == Friendly.say_hello("World"), "Should return \"Hello, World\"" );
                              Console.WriteLine ("All Tests Pass");
                      }
              }
      }
    #+END_SRC
