index.html

<li><a id="sec-5-2-5-3" name="sec-5-2-5-3"></a>Step Definitions<br  /><div class="outline-text-5" id="text-5-2-5-3">
<div class="org-src-container">

<pre class="src src-js">say_hello = require(<span style="color: #008000;">'../../say_hello.js'</span>);

<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">myStepDefinitionsWrapper</span> = <span style="color: #0000FF;">function</span> () {
    <span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">name</span>, <span style="color: #BA36A5;">result</span>, <span style="color: #BA36A5;">error</span> = <span style="color: #D0372D;">false</span>;

    <span style="color: #D0372D;">this</span>.Given(<span style="color: #008000;">/^your name is (\d+)$/</span>, <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">arg1</span>, <span style="color: #BA36A5;">callback</span>) {
        name = +arg1;
        callback();
    });

    <span style="color: #D0372D;">this</span>.Given(<span style="color: #008000;">/^your name is "([^"]*)"$/</span>, <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">arg1</span>, <span style="color: #BA36A5;">callback</span>) {
        name = arg1;
        callback();
    });

    <span style="color: #D0372D;">this</span>.Given(<span style="color: #008000;">/^your name is User Hash$/</span>, <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">callback</span>) {
        name = { name: <span style="color: #008000;">"MyNameHere"</span> };
        callback();
    });


    <span style="color: #D0372D;">this</span>.When(<span style="color: #008000;">/^I say ([^"]*)/</span>, <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">arg1</span>, <span style="color: #BA36A5;">callback</span>) {
        <span style="color: #0000FF;">try</span> {
            result = say_hello(name);
            callback();
        } <span style="color: #0000FF;">catch</span>(e) {
            error = <span style="color: #D0372D;">true</span>;
            result = e;
            callback()
        }
    });

    <span style="color: #D0372D;">this</span>.Then(<span style="color: #008000;">/^the result is "([^"]*)"$/</span>, <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">arg1</span>, <span style="color: #BA36A5;">callback</span>) {
        <span style="color: #0000FF;">if</span> (arg1 !== result) {
            callback.fail(<span style="color: #008000;">"Expected: "</span> + arg1 + <span style="color: #008000;">". Actual: "</span> + result);
        } <span style="color: #0000FF;">else</span> {
            callback();
        }
    });

    <span style="color: #D0372D;">this</span>.Then(<span style="color: #008000;">/^the result is ArgumentException$/</span>, <span style="color: #0000FF;">function</span> (<span style="color: #BA36A5;">callback</span>) {
        <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Write code here that turns the phrase above into concrete actions</span>
        <span style="color: #0000FF;">if</span> (error) {
            callback();
        } <span style="color: #0000FF;">else</span> {
            callback.fail(<span style="color: #008000;">"Expected error"</span>);
        }
    });


}

module.exports = myStepDefinitionsWrapper;
</pre>
</div>
</div>
</li>
<li><a id="sec-5-2-5-4" name="sec-5-2-5-4"></a>Run on command line<br  /><div class="outline-text-5" id="text-5-2-5-4">
<div class="org-src-container">

<pre class="src src-sh">cucumber-js -f pretty
</pre>
</div>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Clojure</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1">Say Hello in Clojure</h4>
<div class="outline-text-4" id="text-5-3-1">
<div class="org-src-container">

<pre class="src src-clojure" id="say_hello_clj">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">say_hello</span> [name] 
 (<span style="color: #0000FF;">if</span> (string? name) 
   (apply str (concat <span style="color: #008000;">"Hello, "</span> name)) 
   (<span style="color: #0000FF;">throw</span> (<span style="color: #6434A3;">Exception.</span> 
           (apply str (concat <span style="color: #008000;">"This is not a string. It is a "</span> (type name)))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2">Simplest possible test case</h4>
<div class="outline-text-4" id="text-5-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(load-file <span style="color: #008000;">"say_hello.clj"</span>)
(say_hello <span style="color: #008000;">"World"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3">clojure.test framework</h4>
<div class="outline-text-4" id="text-5-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(use '<span style="color: #6434A3;">clojure.test</span>)

(load-file <span style="color: #008000;">"say_hello.clj"</span>)

(<span style="color: #0000FF;">deftest</span> <span style="color: #006699;">hello-world-test</span>
  (testing <span style="color: #008000;">"returns Hello, World"</span>
    (is (= <span style="color: #008000;">"Hello, World"</span> (say_hello <span style="color: #008000;">"World"</span>))))))

(run-tests)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">CSharp</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-sec-5-4-1" class="outline-4">
<h4 id="sec-5-4-1">Say Hello in CSharp</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">

<pre class="src src-csharp" id="say_hello_csharp"><span style="color: #0000FF;">using</span> <span style="color: #D0372D;">System</span>;

<span style="color: #0000FF;">namespace</span> <span style="color: #D0372D;">HelloCSharp</span>
{
    <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Friendly</span> {
        <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">EXAMPLE ONLY: DON'T DO THIS</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Real C# programs should not use "object" as argument type!</span>
        <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">string</span> <span style="color: #006699;">say_hello</span>( <span style="color: #6434A3;">object</span> <span style="color: #BA36A5;">name</span> ){ 
            <span style="color: #006699;">if</span> (name <span style="color: #0000FF;">is</span> <span style="color: #6434A3;">String</span>) {
                <span style="color: #0000FF;">return</span> <span style="color: #008000;">"Hello, "</span> + name;
            }

            <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArgumentError</span>(<span style="color: #008000;">"This is not a string. It is a "</span> + <span style="color: #0000FF;">typeof</span>(<span style="color: #6434A3;">name</span>));
        }
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-4-2" class="outline-4">
<h4 id="sec-5-4-2">Simplest possible test</h4>
<div class="outline-text-4" id="text-5-4-2">
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #0000FF;">using</span> <span style="color: #D0372D;">System</span>;
<span style="color: #0000FF;">using</span> <span style="color: #D0372D;">System.Diagnostics</span>;

<span style="color: #0000FF;">namespace</span> <span style="color: #D0372D;">HelloCSharp</span>
{
        <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">MainClass</span>
        {
                <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">Main</span> (<span style="color: #6434A3;">string</span>[] <span style="color: #BA36A5;">args</span>)
                {
                        <span style="color: #6434A3;">Debug</span>.<span style="color: #006699;">Assert</span>(<span style="color: #008000;">"Hello, World"</span> == <span style="color: #6434A3;">Friendly</span>.<span style="color: #006699;">say_hello</span>(<span style="color: #008000;">"World"</span>), <span style="color: #008000;">"Should return \"Hello, World\""</span> );
                        <span style="color: #6434A3;">Console</span>.<span style="color: #006699;">WriteLine</span> (<span style="color: #008000;">"All Tests Pass"</span>);
                }
        }
}
</pre>
</div>
</div>
</div>
