index.org
*** Test with NUnit Framework

    #+BEGIN_SRC csharp
      using NUnit.Framework;
      using System;
      using HelloFriendly;

      namespace TestFriendly
      {
              [TestFixture ()]
              public class Test
              {
                      [Test ()]
                      public void ShouldReturnHelloWorld ()
                      {
                              Assert.AreEqual ("Hello, World", Friendly.say_hello ("World"), "Should be Hello, World");
                      }

                      [Test ()]
                      public void ShouldRaiseErrorOnNumber()
                      {
                              var ex = Assert.Throws<ArgumentException>( () =>
                                              Friendly.say_hello (3)
                              );

                              Assert.AreEqual (ex.Message, "This is not a string. It is a Int32");
                      }

                      [Test ()]
                      public void ShouldRaiseErrorOnHash()
                      {
                              var hello = new System.Collections.Hashtable();
                              var ex = Assert.Throws<ArgumentException>( () =>
                                      Friendly.say_hello (hello)
                              );

                              Assert.AreEqual (ex.Message, "This is not a string. It is a Hashtable");
                      }
              }
      }
    #+END_SRC

*** Cucumber with C#						   :noexport:
** Java
*** Say Hello in Java
    #+BEGIN_SRC java :tangle Friendly.java
      class Friendly {
          // EXAMPLE ONLY: DON'T DO THIS
          // Real Java programs should not use "object" as argument type!
          public static String say_hello(Object name) {
              if (name instanceof String) {
                  return "Hello, " + name;
              }

              throw new IllegalArgumentException("This is not a string. It is a " + name.getClass());
          }
      }
    #+END_SRC
*** Simplest possible test
    #+BEGIN_SRC java :tangle FriendlyTest.java
      class FriendlyTest
      {
          public static void main(String[] args)
          {
              String result = Friendly.say_hello("World");
              assert "Hello, World" == Friendly.say_hello("World");
              System.out.println(result);
          }
      }
    #+END_SRC
*** Test with JUnit

    #+BEGIN_SRC js :tangle FriendlyJUnitTest.java
      import org.junit.Test;

      import org.junit.Assert;


      public class FriendlyJUnitTest {

          @Test
          public void say_hello_works() {
              Assert.assertEquals( "Hello, World", Friendly.say_hello("World") );
          }

          @Test(expected=IllegalArgumentException.class)
          public void say_hello_number_throw_error() {
              Friendly.say_hello(3);
          }
          
          @Test(expected=IllegalArgumentException.class)
          public void say_hello_object_throw_error() {
              Friendly.say_hello(new Object());
          }
      }

    #+END_SRC

