index.html
<div id="outline-container-sec-5-4-3" class="outline-4">
<h4 id="sec-5-4-3">Test with NUnit Framework</h4>
<div class="outline-text-4" id="text-5-4-3">
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #0000FF;">using</span> <span style="color: #D0372D;">NUnit.Framework</span>;
<span style="color: #0000FF;">using</span> <span style="color: #D0372D;">System</span>;
<span style="color: #0000FF;">using</span> <span style="color: #D0372D;">HelloFriendly</span>;

<span style="color: #0000FF;">namespace</span> <span style="color: #D0372D;">TestFriendly</span>
{
        [<span style="color: #6434A3;">TestFixture</span> ()]
        <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Test</span>
        {
                [<span style="color: #6434A3;">Test</span> ()]
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> ShouldReturnHelloWorld ()
                {
                        <span style="color: #6434A3;">Assert</span>.<span style="color: #006699;">AreEqual</span> (<span style="color: #008000;">"Hello, World"</span>, <span style="color: #6434A3;">Friendly</span>.<span style="color: #006699;">say_hello</span> (<span style="color: #008000;">"World"</span>), <span style="color: #008000;">"Should be Hello, World"</span>);
                }

                [<span style="color: #6434A3;">Test</span> ()]
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> ShouldRaiseErrorOnNumber()
                {
                        <span style="color: #0000FF;">var</span> ex = <span style="color: #6434A3;">Assert</span>.<span style="color: #6434A3;">Throws</span>&lt;ArgumentException&gt;( () =&gt;
                                        <span style="color: #6434A3;">Friendly</span>.<span style="color: #006699;">say_hello</span> (3)
                        );

                        <span style="color: #6434A3;">Assert</span>.<span style="color: #006699;">AreEqual</span> (<span style="color: #BA36A5;">ex</span>.<span style="color: #BA36A5;">Message</span>, <span style="color: #008000;">"This is not a string. It is a Int32"</span>);
                }

                [<span style="color: #6434A3;">Test</span> ()]
                <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">void</span> ShouldRaiseErrorOnHash()
                {
                        <span style="color: #0000FF;">var</span> hello = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">System.Collections.Hashtable</span>();
                        <span style="color: #0000FF;">var</span> ex = <span style="color: #6434A3;">Assert</span>.<span style="color: #6434A3;">Throws</span>&lt;ArgumentException&gt;( () =&gt;
                                <span style="color: #6434A3;">Friendly</span>.<span style="color: #006699;">say_hello</span> (hello)
                        );

                        <span style="color: #6434A3;">Assert</span>.<span style="color: #006699;">AreEqual</span> (<span style="color: #BA36A5;">ex</span>.<span style="color: #BA36A5;">Message</span>, <span style="color: #008000;">"This is not a string. It is a Hashtable"</span>);
                }
        }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5">Java</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1">Say Hello in Java</h4>
<div class="outline-text-4" id="text-5-5-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Friendly</span> {
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">EXAMPLE ONLY: DON'T DO THIS</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Real Java programs should not use "object" as argument type!</span>
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">say_hello</span>(<span style="color: #6434A3;">Object</span> <span style="color: #BA36A5;">name</span>) {
        <span style="color: #0000FF;">if</span> (name <span style="color: #0000FF;">instanceof</span> String) {
            <span style="color: #0000FF;">return</span> <span style="color: #008000;">"Hello, "</span> + name;
        }

        <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">IllegalArgumentException</span>(<span style="color: #008000;">"This is not a string. It is a "</span> + name.getClass());
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-5-2" class="outline-4">
<h4 id="sec-5-5-2">Simplest possible test</h4>
<div class="outline-text-4" id="text-5-5-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">FriendlyTest</span>
{
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>)
    {
        <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">result</span> = Friendly.say_hello(<span style="color: #008000;">"World"</span>);
        assert <span style="color: #008000;">"Hello, World"</span> == Friendly.say_hello(<span style="color: #008000;">"World"</span>);
        System.out.println(result);
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-5-3" class="outline-4">
<h4 id="sec-5-5-3">Test with JUnit</h4>
<div class="outline-text-4" id="text-5-5-3">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">import</span> org.junit.Test;

<span style="color: #0000FF;">import</span> org.junit.Assert;


<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> FriendlyJUnitTest {

    @Test
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">void</span> <span style="color: #BA36A5;">say_hello_works</span>() {
        Assert.assertEquals( <span style="color: #008000;">"Hello, World"</span>, Friendly.say_hello(<span style="color: #008000;">"World"</span>) );
    }

    @Test(expected=IllegalArgumentException.<span style="color: #0000FF;">class</span>)
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">void</span> <span style="color: #BA36A5;">say_hello_number_throw_error</span>() {
        Friendly.say_hello(3);
    }

    @Test(expected=IllegalArgumentException.<span style="color: #0000FF;">class</span>)
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">void</span> <span style="color: #BA36A5;">say_hello_object_throw_error</span>() {
        Friendly.say_hello(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Object</span>());
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peter Moresi</p>
<p class="date">Created: 2015-05-07 Thu 11:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
